// Задача 71: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 29

// не нашёл конкретную матаматическую формулу "Аккермана"! 

// данная задача не имеет никакого практического применения, в том числе для совершенствования навыков программирования.   







Console.WriteLine("Hello, World!");
